; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v8 ?v11)
             (pred_5 ?v9 ?v13)
             (pred_7 ?v8 ?v13)
             (pred_10 ?v12 ?v8 )
	     (pred_8 ?v8)
             (pred_6 ?v4)
             (pred_4 ?v9)
             (pred_1 ?v13)
             (pred_11 ?v8)
             (pred_2 ?v9)
             (pred_12 ?v8)
             (pred_9 ))



(:action op_4
:parameters (?v1 ?v10 ?v5 ?v6)
:precondition (and (pred_6 ?v1) (pred_6 ?v10) (pred_4 ?v5) (pred_1 ?v6)
          (pred_3 ?v1 ?v10) (pred_5 ?v5 ?v6)
                   (pred_7 ?v10 ?v6) (pred_8 ?v1) 
                   (pred_11 ?v10) (pred_2 ?v5))
:effect (and  (pred_12 ?v10) (not (pred_11 ?v10))))


(:action op_1
:parameters (?v1 ?v7)
:precondition (and (pred_6 ?v1) (pred_6 ?v7)
               (pred_8 ?v1) (pred_3 ?v1 ?v7) (pred_12 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v1))))

(:action op_3
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_4 ?v5) 
                  (pred_8 ?v1) (pred_10 ?v5 ?v1) (pred_9 ))
:effect (and (pred_2 ?v5)
   (not (pred_10 ?v5 ?v1)) (not (pred_9 ))))


(:action op_2
:parameters (?v1 ?v2 ?v3)
:precondition (and (pred_6 ?v1) (pred_4 ?v2) (pred_4 ?v3)
                  (pred_8 ?v1) (pred_2 ?v3) (pred_10 ?v2 ?v1))
:effect (and (pred_2 ?v2) (pred_10 ?v3 ?v1)
        (not (pred_2 ?v3)) (not (pred_10 ?v2 ?v1))))

(:action op_5
:parameters (?v1 ?v5)
:precondition (and (pred_6 ?v1) (pred_4 ?v5) 
                  (pred_8 ?v1) (pred_2 ?v5))
:effect (and (pred_9 ) (pred_10 ?v5 ?v1) (not (pred_2 ?v5)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_20 obj_05 obj_03 obj_08 obj_22 obj_11 obj_30 obj_26 obj_19 obj_23 obj_18 obj_15 obj_01 obj_16 obj_31 obj_06 obj_32 obj_04 obj_13 obj_02 obj_28 obj_27 obj_29 obj_07 obj_14
    obj_25 obj_24 obj_12
    obj_21 obj_17 obj_10 obj_09
    )

    (:init
       (pred_9)

       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_22)
       (pred_6 obj_11)
       (pred_6 obj_30)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_23)
       (pred_6 obj_18)
       (pred_6 obj_15)
       (pred_6 obj_01)
       (pred_6 obj_16)
       (pred_6 obj_31)
       (pred_6 obj_06)
       (pred_6 obj_32)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_28)
       (pred_6 obj_27)
       (pred_6 obj_29)
       (pred_6 obj_07)
       (pred_6 obj_14)
       (pred_1 obj_25)
       (pred_1 obj_24)
       (pred_1 obj_12)
       (pred_4 obj_21)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_09)

       (pred_3 obj_20 obj_11)
       (pred_3 obj_20 obj_05)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_03 obj_26)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_30)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_30 obj_15)
       (pred_3 obj_30 obj_26)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_30 obj_11)
       (pred_3 obj_26 obj_01)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_26 obj_03)
       (pred_3 obj_26 obj_30)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_23)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_19 obj_26)
       (pred_3 obj_23 obj_31)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_19)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_15 obj_32)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_30)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_01 obj_26)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_16 obj_19)
       (pred_3 obj_16 obj_01)
       (pred_3 obj_31 obj_02)
       (pred_3 obj_31 obj_23)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_06 obj_28)
       (pred_3 obj_06 obj_32)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_32 obj_27)
       (pred_3 obj_32 obj_04)
       (pred_3 obj_32 obj_15)
       (pred_3 obj_32 obj_06)
       (pred_3 obj_04 obj_29)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_04 obj_32)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_31)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_28 obj_27)
       (pred_3 obj_28 obj_06)
       (pred_3 obj_27 obj_29)
       (pred_3 obj_27 obj_32)
       (pred_3 obj_27 obj_28)
       (pred_3 obj_29 obj_07)
       (pred_3 obj_29 obj_04)
       (pred_3 obj_29 obj_27)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_07 obj_29)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_32)
       (pred_11 obj_29)
       (pred_7  obj_08 obj_25)
       (pred_7  obj_05 obj_24)
       (pred_7  obj_32 obj_12)
       (pred_7  obj_29 obj_25)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_22)
       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_19)
       (pred_12 obj_23)
       (pred_12 obj_18)
       (pred_12 obj_15)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_31)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_12 obj_13)
       (pred_12 obj_02)
       (pred_12 obj_28)
       (pred_12 obj_27)
       (pred_12 obj_07)
       (pred_12 obj_14)

       (pred_5  obj_21 obj_25)
       (pred_5  obj_17 obj_24)
       (pred_5  obj_10 obj_12)
       (pred_5  obj_09 obj_25)
       (pred_10 obj_21 obj_15)
       (pred_10 obj_17 obj_23)
       (pred_10 obj_10 obj_15)
       (pred_10 obj_09 obj_06)
       (pred_8 obj_19)
    )

    (:goal (and
       (pred_10 obj_21 obj_31)
       (pred_10 obj_10 obj_16)
    ))
(:constraints
  (always (not (pred_8 obj_01)))
)
)

; plan
1. (op_1 obj_19 obj_26)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_26)
   goals met: 0 of 2
2. (op_1 obj_26 obj_30)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_30)
   goals met: 0 of 2
3. (op_1 obj_30 obj_15)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_10)
   deleted: (pred_10 obj_10 obj_15) (pred_9)
   added: (pred_2 obj_10)
   goals met: 0 of 2
5. (op_4 obj_15 obj_32 obj_10 obj_12)
   deleted: (pred_11 obj_32)
   added: (pred_12 obj_32)
   goals met: 0 of 2
6. (op_1 obj_15 obj_32)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_32)
   goals met: 0 of 2
7. (op_1 obj_32 obj_04)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_04)
   goals met: 0 of 2
8. (op_1 obj_04 obj_13)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_13)
   goals met: 0 of 2
9. (op_1 obj_13 obj_16)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_16)
   goals met: 0 of 2
10. (op_5 obj_16 obj_10)
   deleted: (pred_2 obj_10)
   added: (pred_9) (pred_10 obj_10 obj_16)
   goals met: 1 of 2
11. (op_1 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 1 of 2
12. (op_1 obj_13 obj_04)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_04)
   goals met: 1 of 2
13. (op_1 obj_04 obj_32)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_32)
   goals met: 1 of 2
14. (op_1 obj_32 obj_15)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_15)
   goals met: 1 of 2
15. (op_3 obj_15 obj_21)
   deleted: (pred_10 obj_21 obj_15) (pred_9)
   added: (pred_2 obj_21)
   goals met: 1 of 2
16. (op_1 obj_15 obj_30)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_30)
   goals met: 1 of 2
17. (op_1 obj_30 obj_26)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_26)
   goals met: 1 of 2
18. (op_1 obj_26 obj_19)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_19)
   goals met: 1 of 2
19. (op_1 obj_19 obj_23)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_23)
   goals met: 1 of 2
20. (op_1 obj_23 obj_31)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_31)
   goals met: 1 of 2
21. (op_5 obj_31 obj_21)
   deleted: (pred_2 obj_21)
   added: (pred_9) (pred_10 obj_21 obj_31)
   goals met: 2 of 2
